Table of Contents
 Class RebarSingle
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a single main rebar in 3D space.
[OpenModelClass("CI.StructModel.Structure.RebarSingle,CI.StructuralElements", "CI.StructModel.Structure.IRebarSingle,CI.BasicTypes")]
public class RebarSingle : RebarBase
Inheritance
object
OpenObject
OpenElementId
RebarBase
RebarSingle
Inherited Members
 RebarBase.Material
 RebarBase.Diameter
 RebarBase.RebarShape
 RebarBase.RebarParentElement
 RebarBase.RebarAllocationElement
 RebarBase.GroupId
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 RebarSingle()
create a new instance.
public RebarSingle()
Properties
 RotationXrad
Returns the rotation (in radians) of the rebar geometry (RebarShape). It is an angle of rotation around AxisX of the reference line.
public double RotationXrad { get; set; }
Property Value
double
 Translation
Returns the translation of the rebar geometry (RebarShape). It is an Insert point in reference line coordinate system
public Vector3D Translation { get; set; }
Property Value
Vector3D
 Edit this page